MPS/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>УдалитьСправочник_ВнешниеПользователи</name>
      <description>Внешние пользователи</description>
    </items>
    <items>
      <name>Справочник_Клиенты</name>
      <description>Клиенты</description>
    </items>
    <items>
      <name>УдалитьСправочник_ПапкиФайлов</name>
      <description>Папка</description>
    </items>
    <items>
      <name>Справочник_Пользователи</name>
      <description>Пользователи</description>
    </items>
    <items>
      <name>Справочник_Файлы</name>
      <description>Файл</description>
    </items>
    <items>
      <name>Справочник_Номенклатура</name>
      <description>Номенклатура</description>
    </items>
  </predefined>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСведений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМеток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредопределенногоНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСведения</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредопределенногоНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

MPS/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/ДополнительныеРеквизитыИСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизитыИСведения</name>
  <type>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>Boolean</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>CatalogRef.ГруппыДоступаНоменклатуры</types>
    <types>String</types>
    <types>Date</types>
    <types>CatalogRef.СегментыНоменклатуры</types>
    <types>Number</types>
    <types>CatalogRef.СегментыПартнеров</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Сценарии</types>
    <types>CatalogRef.Клиенты</types>
    <numberQualifiers>
      <precision>17</precision>
      <scale>5</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Виден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДополнительныхЗначений</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВВидеГиперссылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияИспользуются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияСВесом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыВыбораЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыВыбораЗначенияЯзык1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыВыбораЗначенияЯзык2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыЗначенияЯзык1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыЗначенияЯзык2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокЯзык1</name>
    <comment>АПК:58</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокЯзык2</name>
    <comment>АПК:58</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПолеВвода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодсказкаЯзык1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодсказкаЯзык2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДополнительноеСведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСвойства</name>
    <type>
      <types>EnumRef.ВидыСвойств</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветСвойства</name>
    <type>
      <types>EnumRef.ЦветаСвойств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависимостиДополнительныхРеквизитов</name>
    <attributes>
      <name>ЗависимоеСвойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаборСвойств</name>
      <type>
        <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыВыбораЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

MPS/src/CommonModules/ФормыСлужебныйПКМП/Module.bsl
#Область ГруппаДеньНеделиВремя

// Размещает на форме элементы выбора дней недели и временного диапазона срабатывания.У Объекта формы должны быть
// реквизиты - НеОграничиватьВремяСрабатывания,ВремяС,ВремяПо,ЧасовойПояс
//
// Параметры:
//   Форма - УправляемаяФорма - форма, на которой размещаются элементы
//   ГруппаРазмещения - Строка - имя группы формы, в которую добавляются элементы
//   ЭлементПеред - ЭлементФормы, Неопределено - элемент формы, перед которым вставляются новые элементы.
//                              Если Неопределено, элементы добавляются в конец группы
Процедура ДеньНеделиВремяПриСозданииФормы(Форма, ГруппаРазмещения = "ГруппаДеньНеделиВремя", ЭлементПеред = Неопределено) Экспорт
	
	НеОграничиватьВремяСрабатывания = УправлениеФормамиПКМП.НовоеПолеФлажка(Форма, "НеОграничиватьВремяСрабатывания", "Объект.НеОграничиватьВремяСрабатывания", ГруппаРазмещения, ЭлементПеред);
	НеОграничиватьВремяСрабатывания.УстановитьДействие("ПриИзменении","Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении");
	
	ГруппаВремя = УправлениеФормамиПКМП.НоваяГруппа(Форма, "ГруппаВремя", "",, ГруппаРазмещения, ЭлементПеред);	
	ГруппаВремя.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	УправлениеФормамиПКМП.НоваяДекорацияФормы(Форма, "ДекорацияВремя", "Сработать с ", ГруппаВремя);
	ПолеВремя = УправлениеФормамиПКМП.НовоеПолеВвода(Форма, "ВремяС", "Объект.ВремяС", ГруппаВремя);
	ПолеВремя.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	УстановитьСписокВыбораДляПоляВводаВремени(ПолеВремя);
	
	УправлениеФормамиПКМП.НоваяДекорацияФормы(Форма, "ДекорацияДо", " - ", ГруппаВремя);
	ПолеВремя = УправлениеФормамиПКМП.НовоеПолеВвода(Форма, "ВремяПо", "Объект.ВремяПо", ГруппаВремя);
	ПолеВремя.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	УстановитьСписокВыбораДляПоляВводаВремени(ПолеВремя);
	
	ЧасовойПояс = УправлениеФормамиПКМП.НовоеПолеВвода(Форма, "ЧасовойПояс", "Объект.ЧасовойПояс", ГруппаВремя);
	ЧасовойПояс.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЧасовойПояс.ПодсказкаВвода = Константы.ЧасовойПоясПоУмолчанию.Получить();
	
	УправлениеФормамиПКМП.НоваяКомандаФормы(Форма, "КомандаВыбратьВремя", "Выбрать время", ОтображениеКнопки.КартинкаИТекст, "Подключаемая_ВыбратьДеньНедели");
	
	ГруппаДеньНедели = УправлениеФормамиПКМП.НоваяГруппа(Форма, "ГруппаДеньНедели", "",, ГруппаРазмещения);	
	ГруппаДеньНедели.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	БазоваяДата = '00010101';
	
	Для ДеньНедели = 1 по 7 Цикл
		КнопкаДень = УправлениеФормамиПКМП.НоваяКнопкаФормы(Форма, "ДеньНедели" + ДеньНедели, ВидКнопкиФормы.ОбычнаяКнопка,  "КомандаВыбратьВремя", ГруппаДеньНедели);
		КнопкаДень.Заголовок = ТРег(Формат(БазоваяДата+(ДеньНедели+1) * 86400,"ДФ=ddd;"));
		КнопкаДень.Фигура = ФигураКнопки.Овал;
	КонецЦикла;	
	
КонецПроцедуры	

// Заполняет список выбора поля формы значениями времени с шагом 15 минут
// и настраивает режим выбора из списка.
//
// Параметры:
//   Элемент - ПолеФормы - поле формы, для которого заполняется список выбора времени
Процедура УстановитьСписокВыбораДляПоляВводаВремени(Элемент) Экспорт
	
	Для Час = 0 По 23 Цикл
		Для Минута = 0 По 3 Цикл
			Время = Дата(1, 1, 1, Час, Минута*15, 0);
			ВремяСтрока = Формат(Время, "ДФ=ЧЧ:мм; ДП=00:00;");
			Элемент.СписокВыбора.Добавить(Время, ВремяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	Элемент.РежимВыбораИзСписка = Истина;
	Элемент.КнопкаВыпадающегоСписка = Истина;
	Элемент.Формат = "ДФ=HH:mm";
	Элемент.ФорматРедактирования = "ДФ=HH:mm";
КонецПроцедуры	

#КонецОбласти 



#Область ОбработкаСписковЗначений

Процедура СписокВыбораИзРеквизитовПоТипу(Элемент, ОбъектСсылка, ТипРеквизита) Экспорт
	
	МД = 	ОбъектСсылка.Метаданные();
	Если не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МД, "Реквизиты") Тогда Возврат; КонецЕсли;
	
	Для каждого Реквизит из МД.Реквизиты Цикл
		Если Реквизит.Тип.Типы().Количество()=1 и Реквизит.Тип.Типы()[0] = ТипРеквизита Тогда
			Элемент.СписокВыбора.Добавить(Реквизит.Имя,Реквизит.Синоним);
		КонецЕсли;	
	КонецЦикла;	

	Если УправлениеСвойствамиСлужебный.ЭтоОбъектМетаданныхСоСвойствами(МД, "ДополнительныеРеквизиты") Тогда
		ИмяНабораДопРеквизитов = СтрЗаменить(МД.ПолноеИмя(),".","_");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТ_Наборы
			|ИЗ
			|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
			|ГДЕ
			|	НаборыДополнительныхРеквизитовИСведений.Предопределенный
			|	И НаборыДополнительныхРеквизитовИСведений.ИмяПредопределенныхДанных = &ИмяНабораДопРеквизитов
			|	И НаборыДополнительныхРеквизитовИСведений.Используется
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка,
			|	ДополнительныеРеквизитыИСведения.Имя КАК Имя
			|ИЗ
			|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Наборы КАК ВТ_Наборы
			|		ПО ВТ_Наборы.Ссылка = ДополнительныеРеквизитыИСведения.НаборСвойств";
		
		Запрос.УстановитьПараметр("ИмяНабораДопРеквизитов", ИмяНабораДопРеквизитов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СсылкаСвойства = ВыборкаДетальныеЗаписи.Ссылка;
			Если СсылкаСвойства.ТипЗначения.Типы().Количество()=1 и СсылкаСвойства.ТипЗначения.Типы()[0] = ТипРеквизита Тогда
				//в начало имени добавлен "+" для разделения источника 
				Элемент.СписокВыбора.Добавить("+"+СсылкаСвойства.Имя,СсылкаСвойства.Наименование+"(доп.рекв)");
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры	

// Склоняет представления элементов перечислений в списке значений по заданному числовому значению и падежу.
//
// Параметры:
//  Список - СписокЗначений - список значений, содержащий элементы перечислений, представления которых необходимо склонять.
//             Элемент списка:
//               * Значение - ПеречислениеСсылка - значение перечисления, для которого выполняется склонение.
//               * Представление - Строка - склоненное представление значения перечисления.
//  ЧисловоеЗначение - Число - числовое значение, определяющее форму склонения.
//  Падеж - Строка - код падежа для склонения (например, "Именительный", "Родительный").
Процедура СклонениеПредставленийПеречисленийВСпискеПоЧисловомуЗначению(Список, ЧисловоеЗначение, Падеж) Экспорт
	Для каждого ЭлементСписка из Список Цикл
		Если не Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(ЭлементСписка.Значение)) Тогда Продолжить; КонецЕсли;
		ЗначениеИсходное = ОбщегоНазначения.ИмяЗначенияПеречисления(ЭлементСписка.Значение);
		мсСклонений = ПолучитьСклоненияСтрокиПоЧислу(ЗначениеИсходное, ЧисловоеЗначение,,, "ПД="+Падеж);
		Если не мсСклонений.Количество()=0 Тогда
			ЭлементСписка.Представление = мсСклонений[0];
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ДобавитьСтрокуГруппыСписка(Список, НазваниеГруппы) Экспорт
	Список.Добавить("ЭтоГруппа", Новый ФорматированнаяСтрока(НазваниеГруппы, Новый Шрифт(, 11, Истина, Истина)), , БиблиотекаКартинок.Группировка);
КонецПроцедуры
#КонецОбласти
